# 练习:
#   1.打印从零开始的浮点数，每个数增加0.5,打印处10以内的这样的数
#     0.0 0.5 1.0 1.5 ... 9.0 9.5
#   2.写程序求:
#     1/1 + 1/3 + 1/5 + 1/7 + ..... + 1/99 的和
#   3.输入一个整数表示三角形的宽度和高度，打印出如下的三角形:
#     如:
#       请输入三角形的宽度: 4
#     打印如下:
#       *
#       **
#       ***
#       ****
#   4.写程序，输入一个整数代表正方形的宽和高， 打印如下的正方形:
#     如:
#       请输入宽度: 5
#       打印正方形如下:
#       1 2 3 4 5
#       2 3 4 5 6
#       3 4 5 6 7
#       4 5 6 7 8
#       5 6 7 8 9
#     如:
#       请输入宽度: 4
#     打印正方形如下:
#     1 2 3 4 
#     2 3 4 5 
#     3 4 5 6 
#     4 5 6 7  


#第一题
# a = 0.0
# while a < 10:
#     print(a)
#     a += 0.5

#第二题
# a = 1
# b = 0
# while a < 100:
#     b = b + 1 / a
#     a += 2
# print(b)

#第三题
# num = int(input("请输入三角形的宽度:"))
# a = 0
# while a < num:
#     b = 0
#     while b <= a:
#         print("*",end=" ")
#         b += 1
#     print()
#     a += 1

#第四题
# a = int(input("请输入一个整数:"))
# b = 0
# while b <a:
#     n = 1
#     while n <= a:
#         print(n+b,end=" ")
#         n += 1
#     print()
#     b += 1



