# price02.py

# a = input("请输入一组数据")
# print("第一个字符是:",a[0])
# print("最后一个字符是:",a[-1])
# if len(a) % 2 == 1:
#     # center_index = len(a) // 2
#     # print("中间的字符是:",a[center_index])
#     print("中间的字符是:",a[len(a) // 2])

# 1.写一个程序，输入一个字符串，把字符串的第一个字符和最后一个字符去掉后，打印出处理后的字符
# str = input("请输入一段字符:")
# a = str[1:-1]
# print(a)

#2.写一个程序，输入任意一个字符串，判断这个字符串是否是回文
# (回文是指中心对称的文字)
# str = input("请输入回文:")
# if str[::-1] == str:
#     print(str,"是回文")
# else:
#     print(str,"不是回文")


# 3.写一个程序,输入一个字符串，如果字符串不为空，则把第一个字符的编码值打印出来
# str = input("请输入一个字符串:")
# if str != '':
#     a = ord(str[0])
#     print("第一个编码值为:",a)

# 4.写一个程序，输入一个整数(0～65535),打印出这个数值所对应的字符

# a = int(input("请输入一个整数(0~65535):"))
# print(a,"对应的字符为:",chr(a))

    